var crate = "60%";
var level = "B";
var time = "2014-7-28";
var teacher = "孙老师";

//雷达图原始数据，数字是掌握程度
var radarData = {
  x:['函数', '三角函数', '数列', '集合', '立体几何','圆锥曲线'],
  class:[40, 70, 51, 48, 63,84],
  student:[50,60, 44, 36, 75, 71]
};

//掌握程度趋势图原始数据
var trackData = {
  x:['3月5日','3月12日','3月19日','3月26日','4月2日','4月9日','4月16日','4月23日'],
  y:[34,42,56,54,58,66,70,72] 
};

//正确率走势图的原始数据，命名有些问题，数字其实是正确率
var errorData = {
  x:['3月5日','3月12日','3月19日','3月26日','4月2日','4月9日','4月16日','4月23日'],
  class:[60,65,70,50,65,80,65,70],
  student:[50,60,55,55,60,55,60,70]
};

//各板块练习情况的原始数据
var catalog = [
  {
    name:"函数",
    correct:"12/16",
    delta:["up","5%"],
    level:"B",
    pbs:["id1","id2","id3"] //此处是该板块的题目id，不久的将来会用以查看该板块题目
  },
  {
    name:"数列",
    correct:"13/19",
    delta:["down","2%"],
    level:"B",
    pbs:["id1","id2","id3"]
  },
  {
    name:"三角函数",
    correct:"11/13",
    delta:["up","0.5%"],
    level:"A",
    pbs:["id1","id2","id3"]
  }           
];